In [1]:
import pandas as pd

dict={'Name':['King','Queen','Pricess','Prince','Diana','William','Georg'],
      'Marks':[90,89,80,88,90,98,88]}
df=pd.DataFrame(dict)
df

      Name  Marks
0     King     90
1    Queen     89
2  Pricess     80
3   Prince     88
4    Diana     90
5  William     98
6    Georg     88

## 1. Using concat

In [3]:
# New row will be added to existing data frame df
df2=pd.DataFrame({'Name':'Philip','Marks':[99]})
df2

     Name  Marks
0  Philip     99

In [5]:
df3=pd.concat([df2,df])
df3

      Name  Marks
0   Philip     99
0     King     90
1    Queen     89
2  Pricess     80
3   Prince     88
4    Diana     90
5  William     98
6    Georg     88

In [7]:
# create new index instead of default index => set parameter
df3=pd.concat([df2,df],ignore_index=True)
df3

      Name  Marks
0   Philip     99
1     King     90
2    Queen     89
3  Pricess     80
4   Prince     88
5    Diana     90
6  William     98
7    Georg     88

## 2. Using Append

In [8]:
import pandas as pd

dict={'Name':['King','Queen','Pricess','Prince','Diana','William','Georg'],
      'Marks':[90,89,80,88,90,98,88]}
df=pd.DataFrame(dict)
df

      Name  Marks
0     King     90
1    Queen     89
2  Pricess     80
3   Prince     88
4    Diana     90
5  William     98
6    Georg     88

In [11]:
# adding new row by using append method
row1={"Name":"Charle", "Marks":89}
row1

{'Name': 'Charle', 'Marks': 89}

In [12]:
# append
df=df.append(row1,ignore_index=True)
df

C:\Users\Dell\AppData\Local\Temp\ipykernel_21792\2673034779.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(row1,ignore_index=True)

      Name  Marks
0     King     90
1    Queen     89
2  Pricess     80
3   Prince     88
4    Diana     90
5  William     98
6    Georg     88
7   Charle     89

## 3. Using iloc

In [19]:
import pandas as pd

dict={'Name':['King','Queen','Pricess','Prince','Diana','William','Georg'],
      'Marks':[90,89,80,88,90,98,88]}
df=pd.DataFrame(dict)
df

      Name  Marks
0     King     90
1    Queen     89
2  Pricess     80
3   Prince     88
4    Diana     90
5  William     98
6    Georg     88

In [20]:
# adding new row at position 1 (any position can be added) by using iloc
df.iloc[0]=['Anil',89]

In [21]:
df

      Name  Marks
0     Anil     89
1    Queen     89
2  Pricess     80
3   Prince     88
4    Diana     90
5  William     98
6    Georg     88

## 4. Using loc

In [22]:
import pandas as pd

dict={'Name':['King','Queen','Pricess','Prince','Diana','William','Georg'],
      'Marks':[90,89,80,88,90,98,88]}
df=pd.DataFrame(dict)
df

      Name  Marks
0     King     90
1    Queen     89
2  Pricess     80
3   Prince     88
4    Diana     90
5  William     98
6    Georg     88

In [23]:
df.loc[2]=['Rahul',90]

In [24]:
df

      Name  Marks
0     King     90
1    Queen     89
2    Rahul     90
3   Prince     88
4    Diana     90
5  William     98
6    Georg     88

## 5. Drop the rows

In [ ]:
#df.drop([0,1],inplace=True)

In [28]:

df

      Name  Marks
2    Rahul     90
3   Prince     88
4    Diana     90
5  William     98
6    Georg     88

In [29]:
df.reset_index(drop=True)

      Name  Marks
0    Rahul     90
1   Prince     88
2    Diana     90
3  William     98
4    Georg     88

In [1]:
#df.drop([0,1],inplace=True)

## Remove rows from pandas dataframe

In [7]:
import pandas as pd

dict={'Name':['King','Queen','Pricess','Prince','Diana','William','Georg'],
      'Marks':[90,89,80,88,90,98,88]}
df=pd.DataFrame(dict)
df

      Name  Marks
0     King     90
1    Queen     89
2  Pricess     80
3   Prince     88
4    Diana     90
5  William     98
6    Georg     88

In [4]:
x=df[df['Marks']<90]

In [5]:
x.index

Int64Index([1, 2, 3, 6], dtype='int64')

In [6]:
df.drop(x.index)

      Name  Marks
0     King     90
4    Diana     90
5  William     98

In [9]:
# condition can be putted in to method directly
df.drop(df[df['Marks']<90].index)

      Name  Marks
0     King     90
4    Diana     90
5  William     98